Repository: VisionLabs/LunaID-iOS-Examples
Catalog: LunaExample/LunaExample/*.lproj/Localizable.strings
Languages: ru

# settings.save
source: Save
ru: Сохранить

# liveness_type_disabled
source: Disabled
ru: Отключено

# liveness_type_by_image
source: By Photo
ru: По фото

# liveness_type_offline
source: Offline
ru: Оффлайн

# accept.button
source: Accept
ru: Принять

# finish.button
source: Finish
ru: Завершить

# done.button
source: Done
ru: Готово

# success.verify_result
source: Biometric Verification Passed
ru: Биометрическая верификация пройдена

# fail.verify_result
source: Biometric Verification Failed
ru: Биометрическая верификация не пройдена

# success.identify_result
source: Biometric Identification Passed
ru: Биометрическая идентификация пройдена

# fail.identify_result
source: Biometric Identification Failed
ru: Биометрическая идентификация не пройдена

# auth.identify
source: Identification
ru: Идентификация

# auth.identify_with_ocr
source: Identification with documents
ru: Идентификация с документами

# auth.verify
source: Verification
ru: Верификация

# auth.verify_with_ocr
source: Verification with documents
ru: Верификация с документами

# auth.settings
source: Settings
ru: Настройки

# fail.ocr_result
source: Failed to recognise your document
ru: Не удалось распознать документ

# registration.sign_up
source: Register
ru: Регистрация

# registration.successful
source: User registered successfully
ru: Пользователь зарегистрирован

# registration.face.failed
source: This face already used on another user name
ru: Такое лицо уже зарегистрировано

source: Registration failed
ru: Регистрация не удалась

# validation.errors.min_characters
source: Minimum number of characters
ru: Минимальное количество символов

# validation.errors.max_characters
source: Maximum number of characters
ru: Максимальное количество символов

# validation.errors.invalid_characters
source: Invalid characters
ru: Недопустимые символы

# common.error_title
source: Error
ru: Ошибка

# common.open_app_settings
source: Open settings
ru: Перейти в настройки

# success.user_name
source: User name
ru: Имя пользователя

# success.user_name.warning
source: You will be registered in the system under this name
ru: Под этим именем вы будете зарегистрированы в системе

# server.errors.no_user
source: The user does not exist. Please register a new user
ru: Пользователь не найден. Пожалуйста, зарегистрируйтесь

# server.errors.no_person_id
source: PersonID not found. Please register a new user
ru: Пользователь не найден. Пожалуйста, зарегистрируйте нового пользователя

# server.errors.user_name_already_exists
source: Username already taken
ru: Имя пользователя уже занято

# errors.unknown
source: Unknown error
ru: Неизвестная ошибка

# settings.platform_config
source: Platform settings
ru: Настройки платформы

# settings.license_config
source: License settings
ru: Настройки лицензии

# settings.bestshot_config
source: Bestshot settings
ru: Настройки bestshot

# settings.interactions_config
source: Interactions settings
ru: Настройки интеракций

# settings.info_about_versions
source: Info about versions
ru: Информация о версиях

# settings.versions
source: Versions
ru: Версии

# settings.delete_registration
source: Delete registration
ru: Удалить регистрацию

# settings.delete_title
source: Delete
ru: Удалить

# settings.reset_to_defaults
source: Default
ru: По умолчанию

# settings.apply_from_plist
source: Apply from file
ru: Применить из файла

# settings.check_photo
source: Check photo
ru: Проверить снимок

# settings.empty_value
source: Not specified
ru: Не указан

# settings.license.connectionTimeOut_config
source: Connection Timeout
ru: Таймаут соединения

# settings.license.serverRetriesCount_config
source: Server Retries Count
ru: Число попыток

# settings.license.productID_config
source: Product ID
ru: ID продукта

# settings.platform.URL_config
source: Platform URL
ru: URL платформы

# settings.platform.token_config
source: Platform token
ru: Токен платформы

# settings.border_distance
source: Border distance
ru: Отступ от края

# settings.min_det_size
source: Minimal face size
ru: Минимальный размер лица

# settings.detector_step
source: Detector step
ru: Шаг детектора

# settings.skip_frames
source: Skip frames
ru: Пропуск кадров

# settings.minimal_track_length
source: Mninmal track length
ru: Минимальная длина трека

# settings.number_of_bestshots
source: Number of bestshots
ru: Кол-во bestshots

# settings.bestshots_interval
source: Bestshots interval
ru: Время bestshots

# settings.liveness_quality
source: Liveness quality
ru: Коэффицент liveness

# settings.delay_between
source: Задержка между интеракциями
ru: Delay between interactions

# settings.interaction_timeout
source: Timeout интеракции
ru: Interaction timout

# settings.steps_number
source: Кол-во интеракций
ru: Number of interactions

# settings.glassescheck_enabled
source: Sunglasses
ru: Темные очки

# settings.aggregation_enabled
source: Aggregations for sunglasses and close eyes
ru: Агрегация для темных очков и закрытых глаз

# settings.interaction_enabled
source: Interactions
ru: Интеракции

# settings.onlyface_enabled
source: Save only face video
ru: Сохранять видео с лицом

# settings.trackfaceidentity_enabled
source: Track face identity
ru: Отслеживать уникальность лица

# settings.occludedcheck_enabled
source: Face occlusion
ru: Перекрытие лица

# settings.advanced_sunglasses
source: Advanced sunglasses
ru: Продвинутые солнцезащитные очки

# settings.eye_injury
source: Check the conditions of only one eye for opening
ru: Проверять состояния только одного глаза на открытие

# settings.eyescheck_enabled
source: Check eyes state
ru: Проверять состояние глаз

# settings.start_delay
source: Start delay
ru: Задержка перед стартом

# settings.video_record_length
source: Video record length
ru: Ограничение видео записи

# settings.face_time_duration
source: Face time duration
ru: Время фиксации лица в кадре

# settings.compression_quality
source: JPEG compression
ru: Степень сжатия JPEG

# settings.doc_match
source: Docs compare parameter
ru: Степень совпадения документов

# settings.primary_face_matching
source: Degree of match between faces
ru: Степень совпадения лиц

# settings.face_not_found
source: Face was not found
ru: Лицо не найдено в БД

# settings.deletion_successfull
source: Deletion successfull
ru: Регистрация успешно удалена

# settings.error_while_search
source: Error while searching for registered user
ru: Ошибка при поиска пользователя

# settings.error_bestshot
source: Error while making bestshot
ru: Ошибка формирования бестшота

# settings.success_bestshot
source: Bestshot formed
ru: Бестшот сформирован

# errors.identification_error
source: Identification check failed
ru: Идентификация не пройдена

# errors.verification_error
source: Verification check failed
ru: Верификация не пройдена

# errors.user_already_exists
source: User already exists
ru: Пользователь уже зарегистрирован

# errors.document_verification_error
source: Document verification failed
ru: Верификация документа не пройдена

# errors.face_on_document_not_found
source: Photo on document not found
ru: Фотография на документе не найдена

# errors.cancel
source: Operation canceled
ru: Операция отменена

# errors.invalid_file_format
source: Invalid file format
ru: Неверный формат файла

# buttons.do_actions.registration
source: Continue Registration
ru: Продолжить регистрацию

# buttons.do_actions.identify
source: Continue Identification
ru: Продолжить идентификацию

# buttons.do_actions.verify
source: Continue Verification
ru: Продолжить верификацию

# input.placeholder_enter
source: Enter value
ru: Введите значение

source: Given name
ru: Имя

source: Fathers name
ru: Отчество

source: Document ID
ru: Номер документа

# capture_biometric.title
source: Prepare to capture your face
ru: Подготовьтесь к распознаванию лица

# capture_biometric.subtitle
source: For best results please follow the instructions below
ru: Для лучшего результат следуйте инструкциям

# capture_biometric.rules
source: 1. Well-lit, your face should be clearly visible in the camera image. 2. Look at the camera, place your face in the center of the screen. 3. Make sure that there are no other people or pictures of people around you.
ru: Для корректного распознавания лица необходимо: 1. Хорошее освещение. Ваше лицо должно быть отчетливо видно на изображении с камеры. 2. Смотрите в камеру, поместите лицо в центр экрана. 3. Убедитесь, что рядом с вами нет других людей или изображений людей.

# capture_biometric.button
source: Capture biometric
ru: Биометрическая идентификация

# capture_id.title
source: Prepare the ID for capture
ru: Приготовьте документ для распознавания

# capture_id.subtitle
source: For best results please follow the instructions below
ru: Для лучшего результат следуйте инструкциям

# capture_id.rules
source: 1. Capture documents in good illumination conditions and avoid glare effect on the ID face photo 2. ID face photo must be perceptible to the eye 3. Make sure that there are no other people or pictures of people around your ID.
ru: 1. Убедитесь, что помещение, где вы находитесь, достаточно освещено. Избегайте бликов на лице в документе. 2. Лицо должно быть хорошо различимо невооруженным взглядом. 3. Убедитесь, что вокруг документа нет других людей или фотографий других людей.

# capture_id.button
source: Capture ID
ru: Распознать документ

# capture_error.retry_id
source: Retry ID
ru: Переснять документ

# capture_error.retry_biometric
source: Retry biometric
ru: Переснять лицо

# capture_result.check_results
source: Check results
ru: Проверить результаты

# capture_result.retry_or_continue
source: Retry or continue
ru: Попробовать заново или продолжить

# cancel.button
source: Cancel
ru: Завершить
